tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/system/extrudeToRegionMeshDictPyr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          pyrolysisRegion;

faceZones       (coupledWall);

oneD            true;

sampleMode      nearestPatchFace;

extrudeModel    linearNormal;

oneDPolyPatchType empty;

nLayers         8;

expansionRatio  1;

adaptMesh       true; // directMapped for both

linearNormalCoeffs
{
    thickness       0.0039;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
